{
  "name":"日本語",
  "rules": [
    [
      "T[bosh]",
      "T[famous]",
      "T[after]"
    ]
  ],
  "data": {
    "T[bosh]": [
      "今では、趣旨に関する問題を解決するのが一番大事です。そこで、",
      "我々はとても言い難い事実を面せざるを得ない、それが",
      "主旨を発生するには、一体どうやってできるのか；一方、主旨を発生させない場合、何を通じてそれをできるのでしょうか。 ",
      "しかし、こうした件は全部が重要ではない。もっと重要なのは、 ",
      "主旨を発生するには、一体どうやって実現できるのか。 ",
      "これらの疑問を持って、我々は主旨を念入りに考えましょう。 ",
      "主旨と言いますと、主旨をどう書くのが要となる。 ",
      "一般論を述べると、問題のコツをマスターすれば、残りは全て刃を迎えて解くと思われます。 ",
      "問題のコツは到底なんなんでしょうか？ ",
      "主旨はなんのことで発生したのか？",
      "誰でも時々こんな問題に遭遇するのでしょう。  こんな問題に対面している時、 ",
      "一般的には、我々は必ず慎重に考えなければなりません。 ",
      "主旨は一体どんな存在であるかをずばり考えることです。 ",
      "主旨は一体どんな存在なのかをきっちりわかるのが全ての問題の解くキーとなります。 ",
      "個人的に言うなら、主旨は私にとって非常に重要だと言わなければならないです。 ",
      "私本人もじっくり考えながら、夜となく昼となく主旨のことを考えています。 ",
      "主旨は、発生したら何が起こるのか、発生しなければ結果はどうなるのか。 ",
      "こうした困難な選択肢に向き合って、私は思いを巡らせ、居ても立っても居られないです。 ",
      "もし平日に主旨が現れるとしたら、我々はそれが現れたと言う事実を考えなくてはいけないです。 ",
      "こんな事実は私本人に対して深刻な意味を持って、この世界にとってもある程度有意義なことだと信じています。 ",
      "誰もご存知の通り、意義さえあれば、主旨を慎重に考えざるを得ない。 ",
      "そうだとすると、 ",
      "でしたら、 ",
      "私からすると、 ",
      "私にとって、 ",
      "一般的には、 ",
      "とりあえす、 ",
      "こうであれば、 ",
      "上に述べた通り、",
      "この方面から考えるなら、",
      "考え直してみれば、",
      "しかしながら、こんなことでも、主旨の現れにはある意味意義を持っていると考えられる。 "
    ],
    "T[famous]": [
      "アリストテレスT[before] \"垣根\"は相手が作っているのではなく、自分が作っている。",
      "加賀見俊夫T[before] \"足して２で割る\"案は最悪になる。",
      "夏目漱石T[before] 「ああ、ここにおれの進むべき道があった！ようやく掘り当てた！」こういう感投詞を心の底から叫び出される時、貴方がたははじめて心を安んずる事ができるのだろう。",
      "メーソン・クーリーT[before] 「それも、いいじゃないか」は、おもしろい人生のスローガン。",
      "野中日文T[before] 「一喜一憂」をのぞいて我々の人生にいったい何が残るというのか？",
      "Ａ・シリトーT[before] 「運」ってやつは、たえず変わる。いま後頭部にがんと一撃くらわせたかと思うと、次の瞬間には砂糖をほおばらせてくれたりする。問題はただひとつ、へこたれてしまわないことだ。",
      "久保田美文T[before] 「己の長を以って人の短をあらわすなかれ」人は往々にして自分の長所を標準として他人の短所を責めがちなんだ。",
      "ギタ・ベリンT[before] 「私は～しなければならない」と私たちが言う時はいつも、実際にそれをやる場合より、すっと多くのエネルギーを消耗しているのだ。",
      "萩原朔太郎T[before] 「真面目になる」ということは、しばしば「憂鬱になる」ということの外の、何のいい意味でもありはしない。",
      "ブライアン・アダムスT[before] １つのドアが閉まれば、もう１つのドアが必ず開きます。それはバランスをとるための、自然の法則なのだ。",
      "ジミー・コーナーズT[before] １試合にわたって集中力を維持するためには、適度にリラックスすることが絶対に必要だと思う。",
      "ゲーテT[before] ３０分ぐらいでは何もできないと考えているより、世の中の一番つまらぬことでもする方がまさっている。",
      "湯川秀樹T[before] アイデアの秘訣は執念である。",
      "チャップリンT[before] アイデアは、それを一心に求めてさえいれば必ず生まれる。",
      "ホラティウスT[before] あきらめてしまうと、癒しようのない不幸も和らげる。",
      "河合隼雄T[before] あくる朝起きたら、また違う風が吹いているからね。",
      "シェイクスピアT[before] 貴方がたとえ氷のように潔癖で雪のように潔白であろうとも、世の悪口はまぬがれまい。",
      "アインシュタインT[before] 貴方がたの人間性を心にとどめ、そして他のことを忘れよ。",
      "エマーソンT[before] 貴方が今、夢中になっているものを大切にしなさい。それは貴方が真に求めているものだから。",
      "ダグ・マハーショルドT[before] 貴方が持ち合わせた力に余る強さなど、人生は要求しない。貴方にたて得るただひとつの手柄は、そこから逃げないこと。",
      "マルコム・フォーブズT[before] 貴方が成すべきことを成さねばならないのなら、したいことをするための賢明さも持たなくてはならない。",
      "カフカT[before] 貴方と世の中との戦いなら、世の中のほうに賭けなさい。",
      "マーフィーT[before] 貴方に配られたトランプのカードは不利ではない。貴方の考えや感情が不利にも有利にも作用するのだ。",
      "マーフィーT[before] 貴方の考えが積極的で、建設的で愛に満ちていれば正しい結論は必然的に得られます。",
      "ブライアン・アダムスT[before] 貴方の周りを変えようとしてもほとんど意味がない。まず最初に、自分の信念を変えなさい。そうすれば、貴方の周りのあらゆることがそれに応じて、変わる。",
      "ドン・シベットT[before] 貴方の心からくるものは、人の心を動かす。",
      "エリノア・ルーズベルトT[before] 貴方の心が正しいと感じることを行いなさい。行なえば非難されるだろうが、行なわなければ、やはり非難されるのだから。",
      "デニス・ウェイトリーT[before] 貴方の進歩を妨げているのは、貴方が何であるかではなく、貴方が自分を何だと思っているかである。",
      "マーフィーT[before] 貴方の人生は貴方の思いどおりに変えられる。なぜなら貴方自身によってデザインされるのが貴方の人生だからだ。",
      "イグナス・バーンスタインT[before] 貴方の知る最善をなせ。もし貴方がランナーであれば走れ、鐘であれば鳴れ。",
      "マーフィーT[before] 貴方は他人の責任をとる必要はない。貴方が他人に対して負っていることといえば、それは愛と善意だ。",
      "ヘリゲルT[before] 貴方は無心になろうと努めている。つまり貴方は故意に無心なのである。それではこれ以上進むはずがない。",
      "Ｅ・Ｍ・フォースターT[before] あまり人を理解できるとは思わない。わかるのは、好きか嫌いかだけだ。",
      "レオ・Ｃ・ローステンT[before] あまり多くを求めないことだ。とくに他人に対しては。",
      "北畠親房T[before] あめつちの初めは今日より始まる。",
      "ビクトル・ユーゴーT[before] あらあらしい毒づいた言葉は、根拠の弱いものであることが多い。",
      "スピノザT[before] ありあまるほど自由な時間のある人間は、たいてい悪いことを考えるものである。",
      "セネカT[before] 過去はもはや関係がなく、未来はまだ来ぬ。",
      "井上ひさしT[before] ある選択をするということは、その選択によって生まれるはずのマイナスをすべて背負うぞ、ということでやんしょ。",
      "尾崎士郎T[before] あれもいい、これもいいという生き方はどこにもねえや。あっちがよけりゃこっちが悪いに決まっているのだから、これだと思ったときに盲滅法に進まなけりゃ嘘だよ。",
      "シェイクスピアT[before] 貴方の遊びに言い訳はいらない。言い訳を決して言うな。",
      "マーフィーT[before] いかなるものも変化しつつある。これは真理だ。だから貴方がいまどんな苦境にあろうとも、その状態を保持する努力をしない限り、永久に続くはずはないのだ。",
      "トルストイT[before] いかなる時でも、お辞儀はし足りないよりも、し過ぎたほうがいい。",
      "春日潜庵T[before] いかに弱き人といえども、その全力を単一の目的に集中すれば必ずその事を成し得べし。",
      "高野泰明T[before] いかんものは、いくら考えてもよくならん。",
      "松下幸之助T[before] いくら粉飾したところで、自分の生地は誤魔化し切れない。正直こそが、処世の一番安全な道。",
      "豊田佐吉T[before] いくら儲けたいの、いくら儲けねばならんのと、そんな横着な考えでは人間生きてゆけるものではない。",
      "徳川家康T[before] いさめてくれる部下は、一番槍をする勇士より値打ちがある。",
      "吉田兼好T[before] いずかたをも捨てじと心にとり持ちては、一事もなるべからず。",
      "道元T[before] いたずらに過ごす月日の多けれど、道を求める時ぞ少なき。",
      "ハケットT[before] いつまでも人を恨んでいてはならない。貴方が恨んでいる人は、人生を楽しんでいる。",
      "ジョシュア・リーブマンT[before] いつまで一緒にいられるか分からないということをしっかり心にとめてお互いを大切にしよう。",
      "ロバート・ルイス・スティーブンソン（英 小説家）T[before] いつも楽しく暮らすよう心がければ、外的環境から完全にあるいはほとんど解放される。",
      "マザー・テレサT[before] いまの世の中、人間が人間を見捨てているのよね。親が子を、子が親を、兄が弟を、友が友を、隣人が隣人を。",
      "二葉亭四迷T[before] いや、人生は気合だね。",
      "新渡戸稲造T[before] いわゆる十分に力を出す者に限って、おのれに十二分の力があり、十二分の力を出した者がおのれに十五分の力あることがわかってくる。",
      "ラ・ロシュフーコーT[before] うぬぼれというものがついぞなかったら、人生はてんで楽しくあるまい。",
      "Ｌ・Ｌ・コルベルトT[before] うまくいかなかった日は、寝る前に自問する。今ここで何かできることがあるのか、と。なければぐっすり寝る。",
      "シェイクスピアT[before] うわべになにか「徳」のしるしをつけないような素直な「悪」はない。",
      "フリードリヒ・ヘルデルリーンT[before] おお 人情に通じた人よ！彼は子どもたちの相手をするときは子どもっぽいしぐさをする。だが、樹木と子どもは、頭上のものを求めるものなのだ。",
      "勝海舟T[before] おこないはおれのもの、批判は他人のもの、おれの知ったことじゃない。",
      "マーフィーT[before] おだやかな心は問題を解決します。怒りにふるえ、悲しみに打ちひしがれ、嫉妬に狂った心は問題をますます混乱させます。問題の解決は心のおだやかな時にしなさい。",
      "ワシントンT[before] おのれの職分を守り黙々として勤めることは、中傷に対する最上の答えである。",
      "釈迦T[before] おのれの得るところを軽んずるなかれ。",
      "シェイクスピアT[before] お前は、他人のなかにある自分と同じ欠点をむち打とうとするのか。",
      "高杉晋作T[before] おもしろきこともなき世をおもしろく　住みなすものは心なりけり。",
      "Ｄ・カーネギーT[before] およそ人を扱う場合には、相手を論理の動物だと思ってはならない。相手は感情の動物であり、しかも偏見に満ち、自尊心と虚栄心によって行動するということを、よく心得ておかねばならない。",
      "司馬遼太郎T[before] おれは、かつて、おれ自身に惚れこんだことがなかった。自分に惚れこみ、自分の才を信じて事を行えば、人の世に不運などはあるまい。",
      "カーリル・ギブランT[before] お互いに手をつなぐ時にも間をあけよう。",
      "シェイクスピアT[before] お前がそれを抑えつければ抑えつけるほど、ますます燃え上がるよ。静かにささやくように流れていく流れも、せき止められればカンシャクを起こしたように暴れ出すわね。だけどそのさわやかな流れが阻まれなければ、エナメルをかけた石に触れて快い音を奏でるわね。",
      "ホラティウスT[before] お前の分別に一粒の愚かさを混ぜておきたまえ。時をみてばかなことをするのもよいことだ。",
      "シェイクスピアT[before] お前は熊から、のがれようとしている。しかし、その途中で荒れ狂う大海に出会って、もう一度、獣の口のほうへ引きかえすのか？",
      "本居宣長T[before] かぎりを行うのが人の道にして、そのことの成ると成らざるとは人の力におよばざるところぞ。",
      "マーガレット・ロセッティT[before] こういう無批判な愛は嬉しかった。それなら、こちらも惜しみなく愛してやれたから。",
      "テレンティウスT[before] こういう曖昧なものを理屈できっぱりさせようなんてぇのは、理づめで気違いになろうてなもんだよ。",
      "ジェームス三木T[before] こうしようか、ああしようか迷った時は、必ず積極的な方へいく。",
      "ゲーテT[before] ここで今これ以上骨を折っても無駄だ！バラならば、花咲くだろう。",
      "シェイクスピアT[before] ことごとくの雲が嵐をなすというわけではない。",
      "一休T[before] この世にて慈悲も悪事もせぬ人は、さぞや閻魔も困りたまはん",
      "ウォルポールT[before] この世は、考える者にとっては喜劇であり、感じるものにとっては悲劇である。",
      "モンテーニュT[before] この世は絶え間のないシーソーだ。",
      "八尋舜右T[before] 人生というものは、あらゆる規範からはなれ、もっと底抜けに自由であっていいはずだ。",
      "一休T[before] この道を行けばどうなるものか、危ぶむなかれ、危ぶめば道はなし、踏み出せばその一歩が道となる、迷わずゆけよ、ゆけばわかる。",
      "加藤楸邨T[before] この年になると、じっとしているだけで、うれしいことが向こうからやってくる。",
      "シェイクスピアT[before] しかし、所詮は人間、いかに優れた者でも時には我を忘れます。",
      "ディズニーT[before] しなくちゃいけない仕事には、何か楽しめる要素があるもの。",
      "ミルトンT[before] しばしの別離は再会をいっそう快いものにする。",
      "ジャーミーT[before] しゃべったことより、しゃべらずにいたことのほうが力がある。",
      "バイロンT[before] ずいぶん敵も持ったけど、妻よ、お前のようなヤツは初めてだ。",
      "本田宗一郎T[before] すぐれたジョークは、すぐれたアイデアに通じる。",
      "マルティアリスT[before] すべての日がそれぞれの贈り物をもっている。",
      "ソローT[before] すべての不幸は未来への踏み台にすぎない。",
      "トーマス・エジソンT[before] すべては、待っている間に頑張った人のもの。",
      "マーフィーT[before] すべては原因、結果の法則によります。運命論者のいう運・不運は、貴方の思考や行動と無縁ではない。",
      "ゲーテT[before] すべてをいますぐに知ろうとは無理なこと。雪が解ければ見えてくる。",
      "スタール夫人T[before] すべてを納得すれば、心はきわめて寛大になる。",
      "徳川秀忠T[before] すべて軍陣などに臨みて面白しとだに思えば、恐ろしきとこも失せて、自ら計策も出てくるなれ。",
      "山本常朝T[before] すべて人の不仕合せの時、別けて立ち入り、見舞い、付け届けつかまつるべきなり。",
      "シーラ・グレアムT[before] ぜがひでも欲しいと思うものは何でも得られる。それには皮膚から噴き上げ、世界を創造したエネルギーと合流する、あふれんばかりの熱情でそれを望まなければならない。",
      "アイスキュロスT[before] そうあるべきことは、やがてそうなっていくだろう。"
    ],
    "T[after]": [
      "思い返せば。 ",
      "こういう思考を持って、我々はこの問題をより慎重に考え直さねばならない： ",
      "それによって私は啓発されました、 ",
      "諸君にもこの言葉の意味をちゃんと味わわせようと思います。 ",
      "短いながら、この言葉は私に様々な考えを持たせます。 ",
      "こうした中、私の疑問が解けました。"
    ],
    "T[before]": [
      "はこう言いました",
      "は不意にこう言いました",
      "はこのモットーが言いました",
      "はこう言ったことがある"
    ]
  }
}